#pragma once
#ifndef _MAININTERFACE_H_
#define _MAININTERFACE_H_

#include <iostream>
#include <sstream>
using namespace std;

// 不同菜单的提示信息
static const char* menuPrompts[4] = { 
"\
+============+============+==============+============+\n\
| 1.用户登录 | 2.用户注册 | 3.管理员登录 | 4.退出系统 |\n\
+============+============+==============+============+\n\
", \

"\
+=========+===============+================+============+\n\
| 1.添加用户 | 2.删除用户 | 3.查询用户信息 | 4.返回上级 |\n\
+=========+===============+================+============+\n\
", \

"\
+============+============+\n\
| 1.导出图表 | 2.返回上级 |\n\
+=============+===========+\n\
"
};

static const char* welcomInfo = { "\
*****************************************************\n\
**********欢迎使用Fuck COVID-19社区管理系统**********\n\
*****************************************************\n\
"
};

void mainInterface();
#endif